IDEA StatiCa Open Model
TendonBar.PrestressReinforcementType Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 set of prestress reinforcement type
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public FatigueTypeOfPrestressingSteel PrestressReinforcementType { get; set; }
Public Property PrestressReinforcementType As FatigueTypeOfPrestressingSteel
	Get
	Set
public:
property FatigueTypeOfPrestressingSteel PrestressReinforcementType {
	FatigueTypeOfPrestressingSteel get ();
	void set (FatigueTypeOfPrestressingSteel value);
}
Property Value
Type: FatigueTypeOfPrestressingSteel
See Also
Reference
TendonBar Class
IdeaRS.OpenModel.CrossSection Namespace